In [170]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [171]:
df=pd.read_csv("G:\/tested.csv")

In [172]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

First i will remove exctra columns which we donot need i.e PassengerId,Name,Ticket,Cabin,Pclass,SibSp and Embraked which have no role in our prediction

In [173]:
df=df.drop(columns=["PassengerId","Name","Ticket","Cabin","Embarked","Pclass","SibSp","Parch"],axis="columns")

In [174]:
df

     Survived     Sex   Age      Fare
0           0    male  34.5    7.8292
1           1  female  47.0    7.0000
2           0    male  62.0    9.6875
3           0    male  27.0    8.6625
4           1  female  22.0   12.2875
..        ...     ...   ...       ...
413         0    male   NaN    8.0500
414         1  female  39.0  108.9000
415         0    male  38.5    7.2500
416         0    male   NaN    8.0500
417         0    male   NaN   22.3583

[418 rows x 4 columns]

In [175]:
df["Sex"]=df["Sex"].replace("male",1)
df["Sex"]=df["Sex"].replace("female",0)

In [176]:
df

     Survived  Sex   Age      Fare
0           0    1  34.5    7.8292
1           1    0  47.0    7.0000
2           0    1  62.0    9.6875
3           0    1  27.0    8.6625
4           1    0  22.0   12.2875
..        ...  ...   ...       ...
413         0    1   NaN    8.0500
414         1    0  39.0  108.9000
415         0    1  38.5    7.2500
416         0    1   NaN    8.0500
417         0    1   NaN   22.3583

[418 rows x 4 columns]

Our independent variable are Sex,Age and Fare and dependent variable which we want to predict is Survived

In [177]:
x=df.drop(columns=["Survived"],axis="columns")

In [178]:
x

     Sex   Age      Fare
0      1  34.5    7.8292
1      0  47.0    7.0000
2      1  62.0    9.6875
3      1  27.0    8.6625
4      0  22.0   12.2875
..   ...   ...       ...
413    1   NaN    8.0500
414    0  39.0  108.9000
415    1  38.5    7.2500
416    1   NaN    8.0500
417    1   NaN   22.3583

[418 rows x 3 columns]

In [179]:
df.isnull().sum()

Survived     0
Sex          0
Age         86
Fare         1
dtype: int64

In [180]:
df.Age.isnull().sum()

86

In [181]:
df.Age.describe()

count    332.000000
mean      30.272590
std       14.181209
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       76.000000
Name: Age, dtype: float64

In [182]:
df.Age=df.Age.fillna(30.37)

In [183]:
df.Fare.describe()

count    417.000000
mean      35.627188
std       55.907576
min        0.000000
25%        7.895800
50%       14.454200
75%       31.500000
max      512.329200
Name: Fare, dtype: float64

In [184]:
df.Fare.median()

14.4542

In [185]:
df.Fare=df.Fare.fillna(14.45)

In [186]:
df.isnull().sum()

Survived    0
Sex         0
Age         0
Fare        0
dtype: int64

In [192]:
df

     Survived  Sex    Age      Fare
0           0    1  34.50    7.8292
1           1    0  47.00    7.0000
2           0    1  62.00    9.6875
3           0    1  27.00    8.6625
4           1    0  22.00   12.2875
..        ...  ...    ...       ...
413         0    1  30.37    8.0500
414         1    0  39.00  108.9000
415         0    1  38.50    7.2500
416         0    1  30.37    8.0500
417         0    1  30.37   22.3583

[418 rows x 4 columns]

In [193]:
x=df[["Sex","Age","Fare"]]
y=df["Survived"]

In [194]:
from sklearn.linear_model import LogisticRegression

In [195]:
model=LogisticRegression()
model.fit(x,y)

LogisticRegression()

In [199]:
model.predict([[1,30,8]])

c:\Users\Samroz\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but LogisticRegression was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [200]:
model.predict([[0,47,7]])

c:\Users\Samroz\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but LogisticRegression was fitted with feature names
  warnings.warn(

array([1], dtype=int64)